hpmicro/hpm_sdk/soc/HPM6P00/HPM6P81/HPM6P81_svd.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>PDM</name>
      <description>PDM</description>
      <groupName>PDMLITE</groupName>
      <baseAddress>0xf0154000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x24</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x808707FE</resetMask>
          <fields>
            <field>
              <name>SFTRST</name>
              <description>software reset the module. Self-clear.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOF_FEDGE</name>
              <description>asserted if the falling edge of the ref fclk from DAO is the start of a new frame. This is used to to align DAO feedback signal.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFIFO_OVFL_ERR_IE</name>
              <description>output fifo overflow error interrupt enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CIC_OVLD_ERR_IE</name>
              <description>CIC overload error interrupt enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CIC_SAT_ERR_IE</name>
              <description>Error interrupt enable
This bit controls the generation of an interrupt when an error condition  (CIC saturation) occurs.
0: Error interrupt is masked
1: Error interrupt is enabled</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPT_DLY</name>
              <description>Capture cycle delay&gt;=0, should be less than PDM_CLK_HFDIV</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDM_CLK_HFDIV</name>
              <description>The clock divider will work at least 4.
0: div-by-2,
1: div-by-4
. . .
n: div-by-2*(n+1)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDM_CLK_DIV_BYPASS</name>
              <description>asserted to bypass the pdm clock divider</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDM_CLK_OE</name>
              <description>pdm_clk_output_en</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_CTRL</name>
          <description>Channel Control Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FF03FF</resetMask>
          <fields>
            <field>
              <name>CH_POL</name>
              <description>Asserted to select PDM_CLK high level captured, otherwise to select PDM_CLK low level captured.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_EN</name>
              <description>Asserted to enable the channel.
Ch8 &amp; 9 are refs.
Ch0-7 are pdm mics.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST</name>
          <description>Status Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>OFIFO_OVFL_ERR</name>
              <description>output fifo overflow error. The reason may be sampling frequency mismatch, either fast or slow.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CIC_OVLD_ERR</name>
              <description>CIC overload error. write 1 clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CIC_SAT_ERR</name>
              <description>CIC saturation. Write 1 clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIC_CFG</name>
          <description>CIC configuration register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>POST_SCALE</name>
              <description>the shift value after CIC results.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SGD</name>
              <description>Sigma_delta_order[1:0]
2'b00: 7
2'b01: 6
2'b10: 5
Others: unused</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CIC_DEC_RATIO</name>
              <description>CIC decimation factor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RUN</name>
          <description>Run Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>PDM_EN</name>
              <description>Asserted to enable the module</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
