hpmicro/hpm_sdk/soc/HPM6P00/HPM6P81/HPM6P81_svd.xml
        <register>
          <name>OTG_CTRL0</name>
          <description>No description available</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x020B3F90</resetMask>
          <fields>
            <field>
              <name>OTG_WKDPDMCHG_EN</name>
              <description>DP/DM wakeup enable
when USB enters into low power mode(suspend), setting this bit to high, or VBUS is valid(after selected by otg_vbus_source_sel), will wakeup USB(exit suspend),
and send wakeup interrupt if otg_wakeup_int_enable is set to high.
this bit is only used in device mode.
use WKDC/WKCN in PORTSC1 to enable DP/DM wakeup at host mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTORESUME_EN</name>
              <description>auturesume enable
used in host mode only, for response to device remote wakeup if PLL is not enabled in time.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTG_VBUS_WAKEUP_EN</name>
              <description>vbus wakeup enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTG_ID_WAKEUP_EN</name>
              <description>ID wakeup enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTG_VBUS_SOURCE_SEL</name>
              <description>VBUS wakeup source select.
0:  use vbus valid as wakeup source(&gt;4.2V);
1:  use session valid as wakeup source(&gt; about 2.4V);</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTG_UTMI_SUSPENDM_SW</name>
              <description>software usbphy suspend control.
default 0 will suspend usbphy.
user need to set this bit to 1 during usbphy initiallization
NOTE:  make sure at least 1us between setting this bit and clear otg_utmi_reset_sw</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTG_UTMI_RESET_SW</name>
              <description>software usbphy reset control.
default 1 will let usbphy in reset state.
user need to clr this bit to 0 during usbphy initiallization
NOTE:  before clearing this bit, make sure at least 1us after setting otg_utmi_suspendm_sw.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTG_WAKEUP_INT_ENABLE</name>
              <description>wakeup interrupt enable.
when USB in suspend state(PORTSC1.PHCD is 1), user can close all PLL and external crystal, keep internal 24MHz osc active as wakeup clock.
when receive wakeup event and related enable is set, an interrupt to CPU will be asserted if this bit is set.
the interrupt status bit is located at TOP_STATUS.wakeup_int_status，user need clear this bit to 0 to clear the wakeup interrupt.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTG_POWER_MASK</name>
              <description>USB*_PWR polarity control
during host mode, user can config IOMUX to output USB*_PWR pin(which is from PORTSC1.PP), to control external VBUS on/off.
this bit can control the polarity of external VBUS control logic active high or active low(default 0).
user can also use a GPIO to control.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTG_OVER_CUR_POL</name>
              <description>overcurrent polarity control.
during host mode, user can config IOMUX to input USB*_OC as overcurrent status indication(generally come from VBUS control logic).
this bit can control the polarity of overcurrent.
0 for active high;
1 for active low.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTG_OVER_CUR_DIS</name>
              <description>overcurrent disable.
setting this bit to 1 can disable overcurrent function.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SER_MODE_SUSPEND_EN</name>
              <description>setting this bit to 1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PHY_CTRL0</name>
          <description>No description available</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x02007807</resetMask>
          <fields>
            <field>
              <name>GPIO_ID_SEL_N</name>
              <description>ID selection
USBPHY has ID pin, but it maybe not exist in some small package. user can use some GPIO(see pinmux for detail) as ID in these package if need ID functon.
0:  use usbphy ID.
1:  use GPIO ID(need config pinmux)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ID_DIG_OVERRIDE</name>
              <description>ID override value.
use this register as ID value if  id_dig_override_en is set to 1.
this feature is useful when external ID is not used.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SESS_VALID_OVERRIDE</name>
              <description>sess_valid override value.
use this register as session valid value if sess_valid_override_enis set to 1.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBUS_VALID_OVERRIDE</name>
              <description>vbus_valid override value.
use this register as vbus valid value if vbus_valid_override_en is set to 1.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OP_MODE_SUSPENDM_ENJ</name>
              <description>set op_mode to 2'b01 in suspend, for naneng usbphy</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ID_DIG_OVERRIDE_EN</name>
              <description>ID override enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SESS_VALID_OVERRIDE_EN</name>
              <description>SESS_VALID override enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBUS_VALID_OVERRIDE_EN</name>
              <description>VBUS_VALID override enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PHY_CTRL1</name>
          <description>No description available</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00100002</resetMask>
          <fields>
            <field>
              <name>UTMI_CFG_RST_N</name>
              <description>usbphy config reset
defult 0 for usbphy config in reset state.
user need set it to 1 during usbphy initialization.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UTMI_OTG_SUSPENDM</name>
              <description>OTG suspend, not utmi_suspendm.
setting this bit also enable host high-speed disconnect detection logic(check DP/DM voltage at end of SOF, to determine whether 50Ohm are still there on DP/DM)
should clear this bit before entering into suspend state(setting portsc.phcd), avoide unwanted glitch on vbus/sess_vld/sess_end</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TOP_STATUS</name>
          <description>No description available</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000000</resetMask>
          <fields>
            <field>
              <name>WAKEUP_INT_STATUS</name>
              <description>wakeup interrupt status bit.
NOTE: this bit is not write 1 clear. user need clear OTG_CTRL0.otg_wakeup_int_enable to clear wakeup interrupt.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PHY_STATUS</name>
          <description>No description available</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x800000F5</resetMask>
          <fields>
            <field>
              <name>UTMI_CLK_VALID</name>
              <description>usbphy clock valid status bit.
this bit is used to check whether usbphy is outputing valid UTMI clock.
user need write 1 to clear it first, and read to check whether UTMI clock is valid.
0 means no valid UTMI clock; 1 means there's valid UTMI clock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LINE_STATE</name>
              <description>USB bus state.
during full speed or low speed, bit7 is DM state, bit6 is DP state.
during high speed, this filed only appeared whether in data transfer(Squelch), 00 means no data transfer, 01 means active data transfer</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HOST_DISCONNECT</name>
              <description>host disconnection status
this bit is used only for host mode working at high speed.
when high speed device connected, usb host can't use DP/DM status to detect device disconnection.
usbphy will detect device disconnection at end of SOF(32-bit time), by check signal level(400mv or 800mv).
this bit set to 1 means usbphy detect high speed device disconection.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ID_DIG</name>
              <description>usbphy ID pin state.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UTMI_SESS_VALID</name>
              <description>usbphy SESS_VALID state.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBUS_VALID</name>
              <description>usbphy VBUS_VALID state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
